---
type: FilterNumericValueRule
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# FilterNumericValueRule

`Autodesk.Revit.DB.FilterNumericValueRule` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetEvaluator | 2011 | `public FilterNumericRuleEvaluator GetEvaluator ()` |
| Method | SetEvaluator | 2011 | `public void SetEvaluator ( FilterNumericRuleEvaluator evaluator )` |